In [1]:
data = read.csv('Du_lieu/emp.csv')
data

  id name     salary start_date dept
1  1 Rick     623.30 2012-01-01 IT
2  2 Dan      515.20 2013-09-23 Operations
3  3 Michelle 611.00 2014-11-15 IT
4  4 Ryan     729.00 2014-05-11 HR
5 NA Gary     843.25 2015-03-27 Finance
6  6 Nina     578.00 2013-05-21 IT
7  7 Simon    632.80 2013-07-30 Operations
8  8 Guru     722.50 2014-06-17 Finance

In [2]:
is.data.frame(data)

[1] TRUE

In [5]:
print(paste('Max salary: ', max(data$salary)))
print(paste('Mean salary: ', mean(data$salary)))
print(subset(data, salary == max(data$salary)))

[1] "Max salary:  843.25"
[1] "Mean salary:  656.88125"
  id name salary start_date    dept
5 NA Gary 843.25 2015-03-27 Finance

In [6]:
# get IT employees
it_emp = subset(data, dept =='IT')

In [7]:
# write to csv: row.names = FALSE --> do not create a rowname (ID)
write.csv(it_emp, 'Du_lieu_new/it_emp.csv', row.names = FALSE)

In [8]:
newdata = read.csv('Du_lieu_new/it_emp.csv')

In [9]:
newdata

  id name     salary start_date dept
1 1  Rick     623.3  2012-01-01 IT
2 3  Michelle 611.0  2014-11-15 IT
3 6  Nina     578.0  2013-05-21 IT

In [10]:
write.csv(it_emp, 'Du_lieu_new/it_emp_2.csv')

In [11]:
newdata_2 = read.csv('Du_lieu_new/it_emp_2.csv')
newdata_2

  X id name     salary start_date dept
1 1 1  Rick     623.3  2012-01-01 IT
2 3 3  Michelle 611.0  2014-11-15 IT
3 6 6  Nina     578.0  2013-05-21 IT